[
    { "room_id": 1, "user_id": 1, "content": "I just started my fitness journey last month. I'm loving it!" },
    { "room_id": 1, "user_id": 7, "content": "That's awesome! How’s it going so far?" },
    { "room_id": 1, "user_id": 1, "content": "It’s been tough, but I’ve already lost a few pounds. I feel stronger, too." },
    { "room_id": 1, "user_id": 7, "content": "That’s great progress! Do you have a specific goal in mind?" },
    { "room_id": 1, "user_id": 1, "content": "I want to get leaner and improve my strength. Right now, I’m focusing on my upper body." },
    { "room_id": 1, "user_id": 7, "content": "Nice, it’s all about consistency. Keep pushing, you’ll get there!" },
    { "room_id": 1, "user_id": 7, "content": "By the way, have you tried incorporating any cardio into your routine?" },
    { "room_id": 1, "user_id": 1, "content": "Yes, I do about 20 minutes of running after my weight training." },

    { "room_id": 3, "user_id": 1, "content": "I’m planning a road trip this summer, any suggestions?" },
    { "room_id": 3, "user_id": 5, "content": "Road trips are the best! Do you have a destination in mind?" },
    { "room_id": 3, "user_id": 1, "content": "I was thinking of heading to the mountains for a week. I really need to get away from the city." },
    { "room_id": 3, "user_id": 5, "content": "Mountains sound perfect for a peaceful retreat. Do you want to hike or just relax?" },
    { "room_id": 3, "user_id": 1, "content": "I’d love to hike and explore, but I also want to relax in nature, maybe do some stargazing at night." },
    { "room_id": 3, "user_id": 5, "content": "That sounds amazing! I recommend bringing a telescope if you’re really into stargazing." },
    { "room_id": 3, "user_id": 1, "content": "I’ll definitely look into it. And I’ll need to get some good camping gear too." },

    { "room_id": 6, "user_id": 1, "content": "I’ve been trying to improve my cooking skills recently. Have you ever made pasta from scratch?" },
    { "room_id": 6, "user_id": 3, "content": "Yes, I’ve done it a few times! Making the dough is easier than it seems, but it takes a little practice. How about you?" },
    { "room_id": 6, "user_id": 1, "content": "I’ve never tried making it from scratch, but I’ve always wanted to. Do you have a good recipe?" },
    { "room_id": 6, "user_id": 3, "content": "Sure! I usually make spaghetti, and for the sauce, I make it from fresh tomatoes. It tastes so much better than the store-bought stuff!" },
    { "room_id": 6, "user_id": 1, "content": "That sounds delicious! I’m going to try making it this weekend. Do you have a secret ingredient?" },
    { "room_id": 6, "user_id": 3, "content": "Hmm, I like to add a little bit of red wine to the sauce. It gives it a deeper flavor." },
    { "room_id": 6, "user_id": 1, "content": "I never would have thought of that! I’ll definitely give it a try." },
    { "room_id": 6, "user_id": 3, "content": "You’ll love it! Just remember to cook the sauce slowly to bring out the flavors." },
    { "room_id": 6, "user_id": 1, "content": "I’m getting hungry just thinking about it. I can’t wait to try!" },
    { "room_id": 6, "user_id": 3, "content": "Let me know how it turns out!" },
    
    { "room_id": 11, "user_id": 1, "content": "I’m thinking about starting a new hobby. Any suggestions?" },
    { "room_id": 11, "user_id": 8, "content": "How about photography? It’s a lot of fun, and you get to capture beautiful moments!" },
    { "room_id": 11, "user_id": 1, "content": "That’s a great idea! I’ve always loved taking pictures but never really got into it seriously." },
    { "room_id": 11, "user_id": 8, "content": "You should definitely give it a try. You don’t need an expensive camera to start—your phone can work perfectly fine." },
    { "room_id": 11, "user_id": 1, "content": "I guess I could start practicing with my phone. Any tips for a beginner?" },
    { "room_id": 11, "user_id": 8, "content": "Try focusing on composition. Don’t just take random shots, but think about the framing and what story you want to tell." },
    { "room_id": 11, "user_id": 1, "content": "I never thought about it like that. I usually just snap whatever looks interesting." },
    { "room_id": 11, "user_id": 8, "content": "That’s fine, but as you practice, you’ll start noticing the small details. The more you experiment, the better you’ll get!" },
    { "room_id": 11, "user_id": 1, "content": "I’ll keep that in mind. I’m excited to start! Thanks for the advice." },
    { "room_id": 11, "user_id": 8, "content": "You’re welcome! Let me know how it goes. I’d love to see some of your shots." },
    
    { "room_id": 30, "user_id": 1, "content": "I’ve been thinking about starting a podcast. Any tips on getting started?" },
    { "room_id": 30, "user_id": 10, "content": "That’s awesome! The first step is to figure out what your podcast will be about. Have you decided on a theme yet?" },
    { "room_id": 30, "user_id": 1, "content": "I’m not sure yet, but I’m leaning towards a tech-related podcast. Maybe talking about the latest gadgets and software." },
    { "room_id": 30, "user_id": 10, "content": "That sounds like a great idea! Tech is always evolving, so there’s plenty to talk about." },
    { "room_id": 30, "user_id": 1, "content": "Yeah, exactly. I want to keep it current and relevant. What about the equipment? Do I need anything fancy to start?" },
    { "room_id": 30, "user_id": 10, "content": "Not really! You can start with just a decent microphone and some free editing software. Focus on content first, then upgrade your equipment as you go." },
    { "room_id": 30, "user_id": 1, "content": "That’s good to know. I was worried about needing expensive gear right away." },
    { "room_id": 30, "user_id": 10, "content": "No need to worry about that. The key is consistency and engaging content. If you stay consistent, your audience will grow." },
    { "room_id": 30, "user_id": 1, "content": "I’ll keep that in mind. Thanks for the advice! I’m feeling more confident about starting now." },
    { "room_id": 30, "user_id": 10, "content": "You got this! Let me know when you launch your first episode. I’d love to listen!" },
            
    { "room_id": 17, "user_id": 1, "content": "I’m thinking about starting a fitness journey. Any tips on where to begin?" },
    { "room_id": 17, "user_id": 3, "content": "Start with setting some realistic goals! Maybe aim to work out 3-4 times a week at first." },
    { "room_id": 17, "user_id": 5, "content": "I agree! Also, don't forget to focus on nutrition. You can't outwork a bad diet." },
    { "room_id": 17, "user_id": 7, "content": "Yes, and it’s all about consistency. Progress might be slow at first, but keep at it!" },
    { "room_id": 17, "user_id": 1, "content": "That makes sense. I’ll start with some home workouts and clean up my diet." },
    { "room_id": 17, "user_id": 3, "content": "Good plan! You don’t need a gym to get started. There are plenty of great bodyweight exercises." },
    { "room_id": 17, "user_id": 5, "content": "Definitely. Once you get into the routine, you’ll be able to add more challenges." },
    { "room_id": 17, "user_id": 7, "content": "And don’t forget to track your progress. It helps stay motivated!" },

    { "room_id": 19, "user_id": 1, "content": "Anyone got any good recommendations for books to read?" },
    { "room_id": 19, "user_id": 5, "content": "I’m a fan of science fiction. Have you read anything by Isaac Asimov?" },
    { "room_id": 19, "user_id": 7, "content": "I love science fiction too! I would recommend ‘Dune’ by Frank Herbert." },
    { "room_id": 19, "user_id": 9, "content": "I haven’t read Dune yet, but I’ve heard great things. I’d also recommend ‘The Expanse’ series." },
    { "room_id": 19, "user_id": 1, "content": "I’ve heard of ‘The Expanse’. Is it a series or just one book?" },
    { "room_id": 19, "user_id": 5, "content": "It’s a series! There are nine books in total, and they’re all fantastic." },
    { "room_id": 19, "user_id": 7, "content": "If you enjoy space operas, it’s definitely worth checking out!" },
    { "room_id": 19, "user_id": 9, "content": "It’s a gripping series, full of political intrigue and action!" },

    { "room_id": 21, "user_id": 1, "content": "Has anyone tried out the new tech gadgets this year?" },
    { "room_id": 21, "user_id": 2, "content": "I just got the new iPhone! It’s amazing." },
    { "room_id": 21, "user_id": 9, "content": "Nice! I’ve been eyeing the new Samsung Galaxy. Has anyone tested it out yet?" },
    { "room_id": 21, "user_id": 1, "content": "I haven’t, but I’ve heard good things about it. How’s the camera?" },
    { "room_id": 21, "user_id": 2, "content": "The camera’s fantastic! Low-light shots are way better now." },
    { "room_id": 21, "user_id": 9, "content": "That’s awesome. I might consider upgrading. I’ve been using the Galaxy S20." },
    { "room_id": 21, "user_id": 1, "content": "I’m still using my old iPhone, but I’m waiting for the next model to drop." },
    { "room_id": 21, "user_id": 2, "content": "Definitely worth the wait. The new features are worth it." },

    { "room_id": 25, "user_id": 1, "content": "I’m thinking about going on a vacation soon. Any recommendations for a relaxing destination?" },
    { "room_id": 25, "user_id": 8, "content": "I highly recommend Bali. Beautiful beaches and amazing culture." },
    { "room_id": 25, "user_id": 6, "content": "That sounds great! I’ve also heard great things about the Maldives." },
    { "room_id": 25, "user_id": 1, "content": "Both sound perfect. I’ll check them out. I’m looking for a place with good food too." },
    { "room_id": 25, "user_id": 8, "content": "Bali has incredible food! You can try a lot of local dishes like Nasi Goreng." },
    { "room_id": 25, "user_id": 6, "content": "The Maldives has great seafood, especially fresh tuna." },
    { "room_id": 25, "user_id": 1, "content": "Both sound amazing. I think I’ll go with Bali for the cultural experience." },
    { "room_id": 25, "user_id": 8, "content": "You won’t regret it! It’s an amazing place to relax and unwind." },
    { "room_id": 25, "user_id": 6, "content": "Enjoy your trip! Make sure to visit the temples too." }
]
